[
  {
    "title": "Welcome to DelibGraph",
    "text": "You’re looking at a real discussion from an online deliberation platform. Instead of reading a long comment thread, this <strong>Knowledge Graph</strong> lets you see how ideas connect—so you can spot patterns, points of tension, and shared themes.<br><br>An <span class=\"ai-text\">AI</span> analysed the discussion and created clusters and keywords. You stay in control: click nodes to read the original contributions and verify what you see.",
    "visual": "assets/tutorial/step_01.svg",
    "focusType": "ALL"
  },
  {
    "title": "Start from the Subject",
    "text": "The <span class=\"tut-term-subject\">Subject</span> is the main topic of the discussion. Think of it as your central anchor: everything in the debate connects back to it.",
    "visual": "assets/tutorial/step_02.svg",
    "focusType": "SUBJECT",
    "annotation": "The Main Topic"
  },
  {
    "title": "Compare Positions",
    "text": "<span class=\"tut-term-position\">Positions</span> are the main viewpoints people take. Use them to quickly compare where participants stand and how the debate branches out.",
    "visual": "assets/tutorial/step_03.svg",
    "focusType": "POSITION",
    "annotation": "Key Positions"
  },
  {
    "title": "Read the Arguments",
    "text": "<strong>Arguments</strong> are human contributions written in relation to a specific position. The authors classified each contribution as either supporting the position (<span class=\"tut-term-infavor\">IN FAVOR</span>) or challenging it (<span class=\"tut-term-against\">AGAINST</span>).<br><br><strong>Tip:</strong> Click any node to open its details and trace the argument back to the source.",
    "visual": "assets/tutorial/step_04.svg",
    "focusType": "INFAVOR_AGAINST",
    "annotation": "Arguments (Pro/Con)"
  },
  {
    "title": "Discover Thematic Clusters",
    "text": "<span class=\"tut-term-cluster\">Clusters</span> (the background areas) are suggested by <span class=\"ai-text\">AI</span>. They group arguments that talk about similar themes—helping you see what the debate is really about.<br><br>Clusters are a starting point: explore inside them to confirm nuance and context.",
    "visual": "assets/tutorial/step_05.svg",
    "focusType": "CLUSTER",
    "annotation": "Thematic Cluster"
  },
  {
    "title": "Follow Shared Keywords",
    "text": "<span class=\"tut-term-keyword\">Keywords</span> are key terms extracted by <span class=\"ai-text\">AI</span>. They act as semantic bridges by linking arguments that use the same concept—often connecting different sides of the discussion.<br><br>Use keywords to jump across the debate and compare how a concept is used.",
    "visual": "assets/tutorial/step_06.svg",
    "focusType": "ENTITY",
    "annotation": "Semantic Bridge"
  },
  {
    "title": "Connections at a Glance",
    "text": "<strong>Node Size</strong> shows how connected something is: larger nodes have more links to other elements. This helps you spot central arguments, recurring themes, or highly referenced positions.",
    "visual": "assets/tutorial/step_07.svg",
    "focusType": "OUTDEGREE",
    "annotation": "Highly Connected"
  },
  {
    "title": "Now Explore",
    "text": "You’re ready. Try these moves:<br>• <strong>Click</strong> nodes to read details and trace sources.<br>• Use the <strong>Timeline</strong> to replay how the debate evolves.<br>• Use <strong>Filters</strong> to find patterns like contested areas, shared keywords, or lone voices.",
    "visual": "",
    "focusType": "ALL"
  }
]
